# IsCancelled Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CancellationListener..::..IsCancelled Method
CancellationListener Class See Also
---
Returns true if the operation associated with this instance has been cancelled.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool IsCancelled()
```

Visual Basic
---
```text
Public Function IsCancelled As Boolean
```

Visual C++
---
```text
public:
bool IsCancelled()
```

# See Also
CancellationListener Class
Autodesk.Revit.DB Namespace